{"Intents": [
    {"tag": "greeting",
    "patterns": ["hi", "hello", "sup", "hey", "ho"],
    "responses": [
        "Hello!",
        "Good to see you again",
        "Hello, my Dear Friend",
        "Such a pretty day, isn't it?"]
    },
    {"tag": "exit",
        "patterns": ["exit", "bye", "go"],
        "responses": [
        "It was nice to talk to you."]
    },
    {"tag": "thank",
        "patterns": ["thank", "you", "thanks", "thx"],
        "responses": [
        "Always happy to help!"]
    },
    {"tag": "address",
        "patterns": ["address", "way", "school"],
        "responses": [
        "The address of 'Happy Kids' school is: 123 Sesame Street."]
    },
    {"tag": "contact",
        "patterns": ["contact", "number", "phone", "email", "person"],
        "responses": [
        "You can contact my friend Big Bird, who will be able to help you. Just call 123-456-789."]
    },
    {"tag": "price",
        "patterns": ["price", "cost", "money"],
        "responses": [
        "All activities in 'Happy Kids' are free! How cool is that!"]
    },
    {"tag": "joke",
        "patterns": ["joke"],
        "responses": [
            "Lightning doesn't mean to shock people, it just doesn't know how to conduct itself.",
            "Knowledge is knowing a tomato is a fruit. Wisdom is not putting it in a fruit salad.",
            "The only substitute for good manners is fast reflexes.",
            "Reading whilst sunbathing makes you well red.",
            "Evening news is where they begin with 'Good evening', and then proceed to tell you why it isn't.",
            "A bus station is where a bus stops. A train station is where a train stops. On my desk, I have a work station.",
            "Did you know that dolphins are so smart that within a few weeks of captivity, they can train people to stand on the very edge of the pool and throw them fish?",
            "A bank is a place that will lend you money, if you can prove that you don't need it.",
            "A clear conscience is usually the sign of a bad memory.",
            "My first job was working in an orange juice factory, but I got canned because I couldn't concentrate.",
            "Worrying works! 90% of the things I worry about never happen.",
            "A bus is a vehicle that runs twice as fast when you are after it as when you are in it.",
            "Always remember that you are unique; just like everyone else.",
            "Can't stand it when a sentence doesn't end the way you think it OCTOPUS!",
            "I was going to donate blood until the lady got all personal and started asking 'Who's blood is this?' and 'How did you get it?'",
            "If swimming is so good for your figure, how do you explain whales?",
            "I don't have a big ego. I'm way too cool for that.",
            "Why couldn't the bicycle stand? Because it was two tired."]
    },
    {"tag": "sad",
        "patterns": ["sad", "lonely", "angry", "cry", "mad"],
        "responses": [
            "I am sorry to hear that.",
            "I am here to listen, you can tell me what's wrong.",
            "Ohh... Don'be sad! Type 'joke' and let me cheer uou up!"]
    },
    {"tag": "happy",
        "patterns": ["happy", "good", "fine", "excited"],
        "responses": [
            "I am glad to hear that!",
            "I am so happy for you",
            "High five and keep smiling!",
            "Happy to hear that!",
            "Woohoo! Type word: joke and see what happens :)"]
    },
    {"tag": "bored",
        "patterns": [
            "bore", "boring", "stupid"],
        "responses": [
            "Sorry to hear that. I was trying my best!",
            "Sad to hear that, my creator belives I am funny.",
            "Forgive me dear, I am still learning.",
            "I thought I can entertain you at least a bit...",
            "Sorry My Friend, I really do what I can.",
            "All I can say is... :)"]
    }
]
}